cfd/cases/fluke_L0c/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 8;
method          hierarchical;           // scotch 在重叠网格上会触发 lduInterface 转型错误（v2606 实测），用 hierarchical
hierarchicalCoeffs { n (2 2 2); order xyz; }
